<span dir="rtl" style="font-family:B Nazanin" align="right">
    <h1>فصل سوم: تجزیه و تحلیل داده‌ها</h1>
    <h2>بخش اول: مفاهیم اولیه تجزیه و تحلیل داده‌ها</h2>
</span>

<p style = "font-family:B Nazanin;">
   تجزیه و تحلیل داده‌ها فرایندی است که می‌تواند به کمک روش‌های کمی و کیفی به استخراج اطلاعات ارزشمند از داده‌ها بپردازد. مزایای استفاده از تجزیه و تحلیل داده‌ها عبارتند از: <br>
    &nbsp; &nbsp; * بهبود تصمیم‌گیری<br>
    &nbsp; &nbsp; * خدمات بهتر به مشتریان<br>
    &nbsp; &nbsp; * بازاریابی موثرتر<br>
    &nbsp; &nbsp; * عملیات کارآمدتر و صرفه‌جویی در هزینه‌ها <br>
    <br>
    <br>
    انواع روش‌های تجزیه و تحلیل داده‌ها عبارتند از:<br>
    &nbsp; &nbsp; * <b>تجزیه و تحلیل توصیفی:</b> در این روش داده‌های گذشته و حال بررسی می‌شود تا وضعیت فعلی توصیف شود و از روی آن بتوان روندها و الگوهای کاری را تشخیص داد. <br>
    &nbsp; &nbsp; * <b>تجزیه و تحلیل تشخیصی:</b> از روی داده‌ها تشخیص می‌دهیم که چه عوامل و دلایلی باعث ایجاد شرایط امروز شده‌است.<br>
    &nbsp; &nbsp; * <b>تجزیه و تحلیل پیش‌بینی‌کننده:</b> اگر بتوانیم تجزیه و تحلیل را به‌گونه‌ای انجام دهیم که از طریق آن بتوان پیش‌بینی انجام دهیم و یادگیری ماشین را از طریق این پیش‌بینی‌ها رقم بزنیم، به آن تجزیه و تحلیل پیش‌بینی‌کننده می‌گویند. معمولا در این روش مدلسازی آماری اتفاق می‌افتد. <br>
    &nbsp; &nbsp; * <b>تجزیه و تحلیل تجویزی:</b> اگر داده‌ها را تجزیه و تحلیل کرده و بررسی و آزمایش انجام دادیم و در نهایت توانستیم یک سری راه‌حل خاص را برای به‌دست‌آوردن نتایج مطلوب‌تر پیشنهاد بدهیم، می‌گوییم تجزیه و تحلیل تجویزی اتفاق افتاده‌است. <br>
    <br>
    در واقع این روش‌ها در ادامه یکدیگر هستند. یعنی ابتدا وضع گذشته و حال را توصیف می‌کنیم. سپس وضعیت کنونی را تشخیص می‌دهیم. از طریق این موارد آینده را پیش‌بینی می‌کنیم و بر اساس آن برای آینده راه‌حل‌های مناسب تجویز می‌کنیم. 
</p>

<p style = "font-family:B Nazanin;">
    <b>معیارهای کیفیت داده‌ها:</b><br>
    * دقت و صحت داده‌ها (Accuracy): داده‌ها باید صحیح باشند. اوپراتور یا سنسوری که داده‌ها را ثبت می‌کند، باید داده‌های صحیح را ثبت کند. <br>
    * کامل بودن داده‌ها (Completeness): تا حد امکان داده‌ها باید کامل و جامع باشد و نقصی در آن وجود نداشته باشد. <br>
    * قابل اطمینان بودن (Reliability): داده‌ها باید از مراجع و منابع قابل اطمینان و معتبر به دست‌آمده باشند. <br>
    * مرتبط بودن داده‌ها (Relevance): داده‌ها باید به هدف ما مرتبط باشد. جمع‌آوری داده‌های بی‌ربط سودی ندارد و کمکی نمی‌کند. <br>
    * قابل استفاده بودن (Usability): جمع‌بندی تمام موارد قبل قابل استفاده بودن را مشخص می‌کند. <br>
    * ثبات و سازگاری داده (Consistency): داده‌ها در تمام قسمت‌ها باید با هم سازگاری داشته باشند و تناقضی در آن‌ها دیده نشود. <br>
    * تفسیرپذیری داده‌ها (Interpretability): داده‌ها باید آنقدر شفاف و واضح باشد تا بتوان آن را تفسیر کرد. <br>
    * باورپذیری داده‌ها (Believability): داده‌ها باید منطقی و متناسب با واقعیت باشد. <br>
    * به موقع بودن داده‌ها (Timeliness): داده‌ها باید کاملا به‌روز باشد و به صورت بهینه آپدیت شده‌باشد. 
</p>

<p style = "font-family:B Nazanin;">
    <b>چهار عمل اصلی پیش‌پردازش داده‌ها:</b><br>
    پیش‌پردازش داده‌ها فرایندی است که روی داده‌های اولیه انجام می‌شود تا داده‌ها برای تجزیه و تحلیل آماده شود. این مراحل عباتند از:<br>
    * <b>پاکسازی داده‌ها (Data Cleaning):</b> مجموعه فرایندی که باعث می‌شود یک داده اصلاح شود یا اگر داده‌ای نادرست است از سیستم حذف گردد. <br>
    * <b>یکپارچه‌سازی داده‌ها (Data Integration):</b> به مجموعه فرایندهایی که باعث می‌شود داده‌ها از منابع مختلف گردآوری شده، تجمیع شوند و یکپارجه گردند، گفته می‌شود. <br>
    * <b>کاهش داده‌ها (Data Reduction):</b> فرایندی است که بدون این که به داده‌ها آسیبی وارد شود، تا حد امکان داده‌ها را کاهش دهیم تا فرایند پردازش آن‌ها در زمان کمتر با کیفیت بیشتری انجام شود. <br>
    * <b>تبدیل داده‌ها (Data Transformation) و گسسته‌سازی داده‌ها (Data Discretization):</b> به تبدیل فرمت و قالب داده‌ها گفته می‌شود به صورتی که به قالبی تبدیل شود که مناسب برای تجزیه و تحلیل باشد و همچنین تبدیل داده‌های پیوسته (که معمولا از سنسورها گرفته می‌شود) به داده‌های گسسته در این مرحله خواهد بود.  
</p>

<p style = "font-family:B Nazanin;">
    <b>فرایند پاکسازی داده‌ها:</b><br>
    داده‌هایی که نیاز به پاکسازی دارند:<br>
    * سلول خالی (Empty Cell)<br>
    * داده با فرمت اشتباه (Data in wrong format)<br>
    * داده اشتباهی (Wrong data)<br>
    * داده (رکورد) تکراری (Duplicated data)<br>
    <br>
    <b>فعالیت‌های بخش پاکسازی داده:</b><br>
    <b>1. حذف داده‌های تکراری (Remove duplicated data):</b> در این قسمت هدف حذف رکوردهایی است که تمام فیلدهایش یکسان است. ممکن است رکوردهایی وجود داشته باشد که تعدادی از فیلدهای آن با سایر رکوردها یکسان باشد ولی بعضی از فیلدهای آن متفاوت است. این رکوردها را حذف نمی‌کنیم. در اینجا راه تشخیص داده‌های تکراری با استفاده از pandas را بررسی می‌کنیم. فرض می‌کنیم دیتافریم زیر را داشته باشیم:
</p>

In [1]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['mehdi', 'ali', 'negin', 'sara', 'ahmad', 'mehdi', 'saeed', 'sara', 'negin', 'reza'],
    'Family': ['abbasi', 'rezaei', 'zandi', 'safari', 'tavakoli', 'abbasi', 'sadegi', 'safari', 'safari', 'mousavi'],
    'Age': [43,14,37,18,370,43,51,18,37,45]
})
df

    Name    Family  Age
0  mehdi    abbasi   43
1    ali    rezaei   14
2  negin     zandi   37
3   sara    safari   18
4  ahmad  tavakoli  370
5  mehdi    abbasi   43
6  saeed    sadegi   51
7   sara    safari   18
8  negin    safari   37
9   reza   mousavi   45

<p style = "font-family:B Nazanin;">
     همانطور که مشخص است رکوردهای تکراری در این دیتافریم سطرهای 0 و 5 و همچنین سطرهای 3 و 7 هستند. با استفاده از تابع duplicated می‌توانیم سطرهای تکراری را تشخیص بدهیم:
</p>

In [2]:
df = pd.DataFrame({
    'Name': ['mehdi', 'ali', 'negin', 'sara', 'ahmad', 'mehdi', 'saeed', 'sara', 'negin', 'reza'],
    'Family': ['abbasi', 'rezaei', 'zandi', 'safari', 'tavakoli', 'abbasi', 'sadegi', 'safari', 'safari', 'mousavi'],
    'Age': [43,14,37,18,370,43,51,18,37,45]
})
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
8    False
9    False
dtype: bool

<p style = "font-family:B Nazanin;">
     این تابع یک پارامتر ورودی دلخواه به نام keep دارد. این پارامتر مشخص می‌کند کدام یک از سطرها را به عنوان تکراری محسوب کند. این پارامتر سه مقدار می‌تواند بگیرد: <br>
    - 'first': در این حالت اولین مورد از داده‌های تکراری را به عنوان داده اصلی حساب می‌کند و سایر سطرها را به عنوان سطر تکراری در نظر می‌گیرد. <br>
    - 'last': در این حالت آخرین مورد از داده‌های تکراری را به عنوان داده اصلی حساب می‌کند و سایر سطرها را به عنوان سطر تکراری در نظر می‌گیرد. <br>
    - False: در این حالت تمام سطرها را به عنوان تکراری در نظر می‌گیرد.
</p>

In [3]:
df = pd.DataFrame({
    'Name': ['mehdi', 'ali', 'negin', 'sara', 'ahmad', 'mehdi', 'saeed', 'sara', 'negin', 'reza'],
    'Family': ['abbasi', 'rezaei', 'zandi', 'safari', 'tavakoli', 'abbasi', 'sadegi', 'safari', 'safari', 'mousavi'],
    'Age': [43,14,37,18,370,43,51,18,37,45]
})
print(df.duplicated(keep = 'first'))
print('*'*100)
print(df.duplicated(keep = 'last'))
print('*'*100)
print(df.duplicated(keep = False))

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
8    False
9    False
dtype: bool
****************************************************************************************************
0     True
1    False
2    False
3     True
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool
****************************************************************************************************
0     True
1    False
2    False
3     True
4    False
5     True
6    False
7     True
8    False
9    False
dtype: bool

<p style = "font-family:B Nazanin;">
     در صورتی که بخواهیم معیار تشخیص تکراری بودن داده‌ها را ستون‌های خاصی قرار دهیم، دو راه مختلف داریم: یکی این که فقط ستون‌های مورد نظر را از دیتافریم انتخاب کنیم و تابع duplicated را روی آن اعمال کنیم: 
</p>

In [4]:
df = pd.DataFrame({
    'Name': ['mehdi', 'ali', 'negin', 'sara', 'ahmad', 'mehdi', 'saeed', 'sara', 'negin', 'reza'],
    'Family': ['abbasi', 'rezaei', 'zandi', 'safari', 'tavakoli', 'abbasi', 'sadegi', 'safari', 'safari', 'mousavi'],
    'Age': [43,14,37,18,370,43,51,18,37,45]
})
display(df)
print(df['Name'].duplicated())

    Name    Family  Age
0  mehdi    abbasi   43
1    ali    rezaei   14
2  negin     zandi   37
3   sara    safari   18
4  ahmad  tavakoli  370
5  mehdi    abbasi   43
6  saeed    sadegi   51
7   sara    safari   18
8  negin    safari   37
9   reza   mousavi   45

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
8     True
9    False
Name: Name, dtype: bool

<p style = "font-family:B Nazanin;">
     دوم این که نام ستون‌های مورد نظر را به پارامتر subset از تابع duplicated بدهیم:
</p>

In [5]:
df = pd.DataFrame({
    'Name': ['mehdi', 'ali', 'negin', 'sara', 'ahmad', 'mehdi', 'saeed', 'sara', 'negin', 'reza'],
    'Family': ['abbasi', 'rezaei', 'zandi', 'safari', 'tavakoli', 'abbasi', 'sadegi', 'safari', 'safari', 'mousavi'],
    'Age': [43,14,37,18,370,43,51,18,37,45]
})
display(df)
print(df.duplicated(subset = ['Name', 'Age']))

    Name    Family  Age
0  mehdi    abbasi   43
1    ali    rezaei   14
2  negin     zandi   37
3   sara    safari   18
4  ahmad  tavakoli  370
5  mehdi    abbasi   43
6  saeed    sadegi   51
7   sara    safari   18
8  negin    safari   37
9   reza   mousavi   45

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
8     True
9    False
dtype: bool

<p style = "font-family:B Nazanin;">
    برای حذف داده‌های تکراری از تابع drop_duplicated() در ماژول pandas می‌توانیم استفاده کنیم. پارامتر inplace این تابع اگر برابر False باشد، حذف داده‌های تکراری روی همان دیتافریم اثر نمی‌کند، بلکه یک کپی از این دیتافریم ایجاد شده و تغییرات روی آن اعمال می‌شود و در نهایت دیتافریم پاکسازی‌شده خروجی داده می‌شود: 
</p>

In [6]:
df = pd.DataFrame({
    'Name': ['mehdi', 'ali', 'negin', 'sara', 'ahmad', 'mehdi', 'saeed', 'sara', 'negin', 'reza'],
    'Family': ['abbasi', 'rezaei', 'zandi', 'safari', 'tavakoli', 'abbasi', 'sadegi', 'safari', 'safari', 'mousavi'],
    'Age': [43,14,37,18,370,43,51,18,37,45]
})
display(df)
df2 = df.drop_duplicates(inplace = False)
display(df2)

    Name    Family  Age
0  mehdi    abbasi   43
1    ali    rezaei   14
2  negin     zandi   37
3   sara    safari   18
4  ahmad  tavakoli  370
5  mehdi    abbasi   43
6  saeed    sadegi   51
7   sara    safari   18
8  negin    safari   37
9   reza   mousavi   45

    Name    Family  Age
0  mehdi    abbasi   43
1    ali    rezaei   14
2  negin     zandi   37
3   sara    safari   18
4  ahmad  tavakoli  370
6  saeed    sadegi   51
8  negin    safari   37
9   reza   mousavi   45

<p style = "font-family:B Nazanin;">
     تابع drop_duplicates نیز پارامتر subset دارد که مشخص می‌کند معیار تشخیص داده‌های تکراری کدام ستون‌های دیتافریم باشد:
</p>

In [7]:
df = pd.DataFrame({
    'Name': ['mehdi', 'ali', 'negin', 'sara', 'ahmad', 'mehdi', 'saeed', 'sara', 'negin', 'reza'],
    'Family': ['abbasi', 'rezaei', 'zandi', 'safari', 'tavakoli', 'abbasi', 'sadegi', 'safari', 'safari', 'mousavi'],
    'Age': [43,14,37,18,370,43,51,18,37,45]
})
display(df)
df2 = df.drop_duplicates(subset = ['Name'], inplace = False)
display(df2)

    Name    Family  Age
0  mehdi    abbasi   43
1    ali    rezaei   14
2  negin     zandi   37
3   sara    safari   18
4  ahmad  tavakoli  370
5  mehdi    abbasi   43
6  saeed    sadegi   51
7   sara    safari   18
8  negin    safari   37
9   reza   mousavi   45

    Name    Family  Age
0  mehdi    abbasi   43
1    ali    rezaei   14
2  negin     zandi   37
3   sara    safari   18
4  ahmad  tavakoli  370
6  saeed    sadegi   51
9   reza   mousavi   45

<p style = "font-family:B Nazanin;">
     تابع drop_duplicates نیز پارامتر ورودی keep را دارد که مشخص می‌کند از بین داده‌های تکراری کدام حفظ شده و کدام حذف شود. 'first' اولین مورد از داده‌های تکراری را نگه می‌دارد، 'last' آخرین مورد را نگه می‌دارد و False همه داده‌های تکراری را حذف می‌کند:
</p>

In [8]:
df = pd.DataFrame({
    'Name': ['mehdi', 'ali', 'negin', 'sara', 'ahmad', 'mehdi', 'saeed', 'sara', 'negin', 'reza'],
    'Family': ['abbasi', 'rezaei', 'zandi', 'safari', 'tavakoli', 'abbasi', 'sadegi', 'safari', 'safari', 'mousavi'],
    'Age': [43,14,37,18,370,43,51,18,37,45]
})
display(df)
df2 = df.drop_duplicates(keep = 'first', inplace = False)
display(df2)
df3 = df.drop_duplicates(keep = 'last', inplace = False)
display(df3)
df4 = df.drop_duplicates(keep = False, inplace = False)
display(df4)

    Name    Family  Age
0  mehdi    abbasi   43
1    ali    rezaei   14
2  negin     zandi   37
3   sara    safari   18
4  ahmad  tavakoli  370
5  mehdi    abbasi   43
6  saeed    sadegi   51
7   sara    safari   18
8  negin    safari   37
9   reza   mousavi   45

    Name    Family  Age
0  mehdi    abbasi   43
1    ali    rezaei   14
2  negin     zandi   37
3   sara    safari   18
4  ahmad  tavakoli  370
6  saeed    sadegi   51
8  negin    safari   37
9   reza   mousavi   45

    Name    Family  Age
1    ali    rezaei   14
2  negin     zandi   37
4  ahmad  tavakoli  370
5  mehdi    abbasi   43
6  saeed    sadegi   51
7   sara    safari   18
8  negin    safari   37
9   reza   mousavi   45

    Name    Family  Age
1    ali    rezaei   14
2  negin     zandi   37
4  ahmad  tavakoli  370
6  saeed    sadegi   51
8  negin    safari   37
9   reza   mousavi   45

<p style = "font-family:B Nazanin;">
     با استفاده از تابع to_excel می‌توان یک دیتافریم را درون یک فایل اکسل ذخیره کرد:
</p>

In [9]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\alireza\appdata\local\programs\python\python311\lib\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\users\alireza\appdata\local\programs\python\python311\lib\site-packages (from openpyxl) (1.1.0)

In [10]:
df = pd.DataFrame({
    'Name': ['mehdi', 'ali', 'negin', 'sara', 'ahmad', 'mehdi', 'saeed', 'sara', 'negin', 'reza'],
    'Family': ['abbasi', 'rezaei', 'zandi', 'safari', 'tavakoli', 'abbasi', 'sadegi', 'safari', 'safari', 'mousavi'],
    'Age': [43,14,37,18,370,43,51,18,37,45]
})
df.to_excel(r'data.xlsx', index = False)

<p style = "font-family:B Nazanin;">
     در فایل اکسل با استفاده از منوی Conditional Formatting، بخش Highlight Cells Rules، گزینه Duplicate Values، داده‌های تکراری را تشخیص داد. برای حذف داده‌های تکراری نیز از منوی Data گزینه Remove Duplicates را استفاده می‌کنیم.
</p>

<p style = "font-family:B Nazanin;">
    <b>2. پر کردن فیلدهای بدون مقدار (Fill in missing values):</b> خالی ماندن بعضی از سلول‌ها در فرایند پردازش داده‌ها اختلال ایجاد می‌کند. برای رفع این اختلال چند راهکار داریم:<br>
    یکی از راه‌ها این است که کل آن سطر را حذف کنیم. اگر آن سلول خالی به قدری مهم باشد که نبود آن کل ارزش داده آن سطر را از بین ببرد، باید کل آن سطر را حذف کرد. <br>
    روش دوم پر کردن دستی داده‌ها است. برای دیتاست‌های کوچک این روش قابل استفاده است که یکی یکی سلول‌های خالی را بررسی کنیم و برای هر کدام مقدار مناسب را وارد کنیم. اما برای دیتاست‌های بزرگ این روش مناسب نیست.<br>
    روش سوم پر کردن با یک مقدار ثابت است. در این روش تمام سلول‌های خالی مربوط به یک ستون با یک مقدار ثابت پر می‌شود که باز هم ممکن است در بعضی موارد مناسب نباشد. <br>
    روش چهارم پر کردن با مقدار میانگین یا میانه است. در این روش میانگین یا میانه داده‌های موجود را محاسبه می‌کنیم و تمام سلول‌های خالی مربوط به آن ستون را با آن مقدار پر می‌کنیم. <br>
    روش پنجم پر کردن با محتمل‌ترین مقدار است. در این روش با استفاده از روش‌های آماری و تحلیل‌هایی حدس می‌زنیم احتمال اینکه داده‌های سلول‌های خالی چه مقداری باشد، بییشتر است و همان مقدار را برایش در نظر می‌گیریم. این روش یکی از بهترین و دقیق‌ترین روش‌هاست ولی هزینه عملیاتی بالایی دارد. 
</p>

In [22]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
    'name': ['mehdi', 'ali', np.nan, np.nan, 'reza', 'negin', np.nan, 'sara', np.nan, 'mehdi'],
    'family': ['abbasi', 'rezaei', np.nan, 'ahmadi', np.nan, 'abbasi', np.nan, 'rahmati', np.nan, 'akbary'],
    'age': [43, np.nan, np.nan, np.nan, 31, 18, np.nan, np.nan, 20, 31]
})
display(df)

    name   family   age
0  mehdi   abbasi  43.0
1    ali   rezaei   NaN
2    NaN      NaN   NaN
3    NaN   ahmadi   NaN
4   reza      NaN  31.0
5  negin   abbasi  18.0
6    NaN      NaN   NaN
7   sara  rahmati   NaN
8    NaN      NaN  20.0
9  mehdi   akbary  31.0

<p style = "font-family:B Nazanin;">
     تابع isnull نشان می‌دهد که کدام سلول‌ها مقدار ندارند یا به عبارتی null یا NaN هستند:
</p>

In [23]:
print(df.isnull())

    name  family    age
0  False   False  False
1  False   False   True
2   True    True   True
3   True   False   True
4  False    True  False
5  False   False  False
6   True    True   True
7  False   False   True
8   True    True  False
9  False   False  False

<p style = "font-family:B Nazanin;">
     تابع isna نشان می‌دهد کدام سلول‌ها مقدار NaN دارند:
</p>

In [32]:
print(df.isna())

    name  family    age
0  False   False  False
1  False   False   True
2   True    True   True
3   True   False   True
4  False    True  False
5  False   False  False
6   True    True   True
7  False   False   True
8   True    True  False
9  False   False  False

<p style = "font-family:B Nazanin;">
     تابع notnull برعکس تابع isnull عمل می‌کند و هر جا داده‌ای مقدار داشته‌باشد مقدار True را برمی‌گرداند:
</p>

In [24]:
print(df.notnull())

    name  family    age
0   True    True   True
1   True    True  False
2  False   False  False
3  False    True  False
4   True   False   True
5   True    True   True
6  False   False  False
7   True    True  False
8  False   False   True
9   True    True   True

<p style = "font-family:B Nazanin;">
     توابع معرفی‌شده در بالا می‌توانند روی چند ستون خاص یک دیتافریم هم اعمال شود:
</p>

In [25]:
print(df['age'].isnull())

0    False
1     True
2     True
3     True
4    False
5    False
6     True
7     True
8    False
9    False
Name: age, dtype: bool

In [26]:
print(df['age'].notnull())

0     True
1    False
2    False
3    False
4     True
5     True
6    False
7    False
8     True
9     True
Name: age, dtype: bool

<p style = "font-family:B Nazanin;">
     این توابع را می‌توانیم روی ماژول pandas نیز مستقیما اعمال کنیم و نام دیتافریم را به عنوان پارامتر ورودی به آن بدهیم:
</p>

In [27]:
print(pd.isnull(df['age']))

0    False
1     True
2     True
3     True
4    False
5    False
6     True
7     True
8    False
9    False
Name: age, dtype: bool

In [28]:
print(pd.notnull(df['age']))

0     True
1    False
2    False
3    False
4     True
5     True
6    False
7    False
8     True
9     True
Name: age, dtype: bool

<p style = "font-family:B Nazanin;">
     با استفاده از تابع sum می‌توانیم تعداد داده‌های NaN یا Null را بشماریم:
</p>

In [29]:
print(df.isnull().sum())

name      4
family    4
age       5
dtype: int64

In [31]:
print(df.notnull().sum())

name      6
family    6
age       5
dtype: int64